In [1]:
import pandas as pd
sr1 = pd.Series(['Đ','H','K','T'],index=[1,2,3,4])
sr2 = pd.Series(['K','T','C','N'],index=[5,6,7,8])
pd.concat([sr1,sr2])

1    Đ
2    H
3    K
4    T
5    K
6    T
7    C
8    N
dtype: object

In [2]:
sr1

1    Đ
2    H
3    K
4    T
dtype: object

In [3]:
sr2

5    K
6    T
7    C
8    N
dtype: object

In [4]:
import pandas as pd
A=pd.DataFrame([['A0','B0'],['A1','B1']],columns=['A','B'])
B=pd.DataFrame([['A2','B2'],['A3','B3']],columns=['A','B'])

In [5]:
A

    A   B
0  A0  B0
1  A1  B1

In [6]:
B

    A   B
0  A2  B2
1  A3  B3

In [7]:
pd.concat([A,B])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [8]:
print('\nNối A và B theo cột (axis=1):')
display(pd.concat([A,B], axis=1))

Nối A và B theo cột (axis=1):

    A   B   A   B
0  A0  B0  A2  B2
1  A1  B1  A3  B3

In [ ]:
#note
#axis=0 : xếp chồng hàng
#axis=1 : ghép cột

In [9]:
data=[[0,1,0,1],
      [2,1,0,1],
      [1,0,2,0]]
df=pd.DataFrame(data, columns=['A','B','C','D'])
df

   A  B  C  D
0  0  1  0  1
1  2  1  0  1
2  1  0  2  0

In [10]:
df.sum(axis=0)

A    3
B    2
C    2
D    2
dtype: int64

In [11]:
df.sum(axis=1)

0    2
1    4
2    3
dtype: int64

In [12]:
pd.concat([A,B])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [ ]:
pd.concat([A,B], ignore_index=True) # nối theo hàng và reset lại chỉ mục

    A   B
0  A0  B0
1  A1  B1
2  A2  B2
3  A3  B3

In [14]:
print(A)
print(B)

    A   B
0  A0  B0
1  A1  B1
    A   B
0  A2  B2
1  A3  B3

In [15]:
pd.concat([A,B])

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3

In [16]:
try:
    pd.concat([A,B], verify_integrity=True)
except ValueError as e:
    print('Lỗi ValueError:', e)

Lỗi ValueError: Indexes have overlapping values: Index([0, 1], dtype='int64')

In [17]:
pd.concat([A,B], keys=['Data A', 'Data B'])

           A   B
Data A 0  A0  B0
       1  A1  B1
Data B 0  A2  B2
       1  A3  B3

In [18]:
import pandas as pd
df1=pd.DataFrame(
 {
 'Nhân viên':['Bình','Minh','Lan','Vân'],
'Phòng/Ban':['Kế toán','Kỹ thuật','Kỹ thuật','HCQT']
 }
) 
df2=pd.DataFrame(
 {
 'Nhân viên':['Bình','Minh','Lan','Vân'],
 'Năm':[2020,2010,2004,2011]
 }
)

In [19]:
df1

  Nhân viên Phòng/Ban
0      Bình   Kế toán
1      Minh  Kỹ thuật
2       Lan  Kỹ thuật
3       Vân      HCQT

In [20]:
df2

  Nhân viên   Năm
0      Bình  2020
1      Minh  2010
2       Lan  2004
3       Vân  2011

In [21]:
nhanvien=pd.merge(df1, df2)
nhanvien

  Nhân viên Phòng/Ban   Năm
0      Bình   Kế toán  2020
1      Minh  Kỹ thuật  2010
2       Lan  Kỹ thuật  2004
3       Vân      HCQT  2011

In [22]:
#1DataFrame "Một"
quanly=pd.DataFrame(
 {
 'Phòng/Ban':['Kế toán','Kỹ thuật','HCQT'],
'Quản lý':['Ly','Cường','Minh']
 }
)
quanly

  Phòng/Ban Quản lý
0   Kế toán      Ly
1  Kỹ thuật   Cường
2      HCQT    Minh

In [23]:
#2 DataFrame 'Nhiều'
nhanvien

  Nhân viên Phòng/Ban   Năm
0      Bình   Kế toán  2020
1      Minh  Kỹ thuật  2010
2       Lan  Kỹ thuật  2004
3       Vân      HCQT  2011

In [24]:
quanly_to_nhanvien_1_N = pd.merge(nhanvien, quanly, on='Phòng/Ban')
quanly_to_nhanvien_1_N

  Nhân viên Phòng/Ban   Năm Quản lý
0      Bình   Kế toán  2020      Ly
1      Minh  Kỹ thuật  2010   Cường
2       Lan  Kỹ thuật  2004   Cường
3       Vân      HCQT  2011    Minh

In [25]:
nv_salary=pd.DataFrame( 
{
'Name':['Bình','Minh','Lan','Vân'],
'salary':[7000000,9000000,9500000,8000000]
}
)
m1=pd.merge(df1, df2, on='Nhân viên')

m1.head()

  Nhân viên Phòng/Ban   Năm
0      Bình   Kế toán  2020
1      Minh  Kỹ thuật  2010
2       Lan  Kỹ thuật  2004
3       Vân      HCQT  2011

In [26]:
df1

  Nhân viên Phòng/Ban
0      Bình   Kế toán
1      Minh  Kỹ thuật
2       Lan  Kỹ thuật
3       Vân      HCQT

In [27]:
nv_salary

   Name   salary
0  Bình  7000000
1  Minh  9000000
2   Lan  9500000
3   Vân  8000000

In [28]:
m2=pd.merge(df1, nv_salary, left_on='Nhân viên', right_on='Name')
m2.head()

  Nhân viên Phòng/Ban  Name   salary
0      Bình   Kế toán  Bình  7000000
1      Minh  Kỹ thuật  Minh  9000000
2       Lan  Kỹ thuật   Lan  9500000
3       Vân      HCQT   Vân  8000000

In [29]:
m2_drop=m2.drop(columns=['Name'])
m2_drop.head()

  Nhân viên Phòng/Ban   salary
0      Bình   Kế toán  7000000
1      Minh  Kỹ thuật  9000000
2       Lan  Kỹ thuật  9500000
3       Vân      HCQT  8000000

In [30]:
df1_idx=df1.set_index('Nhân viên')
df2_idx=df2.set_index('Nhân viên')

In [31]:
df1_idx

          Phòng/Ban
Nhân viên
Bình        Kế toán
Minh       Kỹ thuật
Lan        Kỹ thuật
Vân            HCQT

In [32]:
df2_idx

            Năm
Nhân viên
Bình       2020
Minh       2010
Lan        2004
Vân        2011

In [33]:
m_idx=pd.merge(df1_idx,df2_idx, left_index=True, right_index=True)
m_idx

          Phòng/Ban   Năm
Nhân viên
Bình        Kế toán  2020
Minh       Kỹ thuật  2010
Lan        Kỹ thuật  2004
Vân            HCQT  2011

In [34]:
df2_idx

            Năm
Nhân viên
Bình       2020
Minh       2010
Lan        2004
Vân        2011

In [35]:
nv_salary

   Name   salary
0  Bình  7000000
1  Minh  9000000
2   Lan  9500000
3   Vân  8000000

In [37]:
mixed=pd.merge(df2_idx, nv_salary, left_index=True, right_on='Name')
mixed.head()

    Năm  Name   salary
0  2020  Bình  7000000
1  2010  Minh  9000000
2  2004   Lan  9500000
3  2011   Vân  8000000

In [38]:
nv_location=pd.DataFrame(
{
'Nhân viên':['Bình', 'Minh','Lan'],
'Nơi sinh':['Hà Nội','Hồ Chí Minh','Nam định']
}
)
nv_age=pd.DataFrame(
{
'Nhân viên':['Bình','Vân','Lan'],
'Age':[22,23,25]
}
)

In [39]:
nv_location

  Nhân viên     Nơi sinh
0      Bình       Hà Nội
1      Minh  Hồ Chí Minh
2       Lan     Nam định

In [40]:
nv_age

  Nhân viên  Age
0      Bình   22
1       Vân   23
2       Lan   25

In [41]:
df_inner=pd.merge(nv_location, nv_age, on='Nhân viên', how='inner')
print('INNER:'); display(df_inner)

INNER:

  Nhân viên  Nơi sinh  Age
0      Bình    Hà Nội   22
1       Lan  Nam định   25

In [43]:
df_outer=pd.merge(nv_location, nv_age, on='Nhân viên', how='outer')
print('OUTER:'); display(df_outer)

OUTER:

  Nhân viên     Nơi sinh   Age
0      Bình       Hà Nội  22.0
1       Lan     Nam định  25.0
2      Minh  Hồ Chí Minh   NaN
3       Vân          NaN  23.0

In [44]:
df_left=pd.merge(nv_location, nv_age, on='Nhân viên', how='left')
print('LEFT:'); display(df_left)

LEFT:

  Nhân viên     Nơi sinh   Age
0      Bình       Hà Nội  22.0
1      Minh  Hồ Chí Minh   NaN
2       Lan     Nam định  25.0

In [50]:
vang_rank=pd.DataFrame({'Nhân viên': ['Bình','Lan','Hà'],'rank':[1,2,3]})
hs_rank=pd.DataFrame({'Nhân viên': ['Bình','Lan','Hà'],'rank':[4,5,6]})

In [51]:
vang_rank

  Nhân viên  rank
0      Bình     1
1       Lan     2
2        Hà     3

In [52]:
hs_rank

  Nhân viên  rank
0      Bình     4
1       Lan     5
2        Hà     6

In [53]:
default_suffix=pd.merge(vang_rank, hs_rank, on='Nhân viên')
default_suffix

  Nhân viên  rank_x  rank_y
0      Bình       1       4
1       Lan       2       5
2        Hà       3       6

In [54]:
custom_suffix = pd.merge(vang_rank, hs_rank, on='Nhân viên', suffixes=('_Ngày vắng','_Hiệu suất'))
print('Mặc định (x, y):'); display(default_suffix)
print('Tùy chỉnh suffixes:'); display(custom_suffix)

Mặc định (x, y):

  Nhân viên  rank_x  rank_y
0      Bình       1       4
1       Lan       2       5
2        Hà       3       6

Tùy chỉnh suffixes:

  Nhân viên  rank_Ngày vắng  rank_Hiệu suất
0      Bình               1               4
1       Lan               2               5
2        Hà               3               6

In [55]:
import pandas as pd
data={
    'Tuổi': [16, 17, 16, 18, 17],
    'Chiều cao': [165, 170, 160, 172, 168],
    'Cân nặng': [55, 60, 52, 65, 58]
}
df=pd.DataFrame(data)
df

   Tuổi  Chiều cao  Cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58

In [56]:
df.describe()

           Tuổi   Chiều cao   Cân nặng
count   5.00000    5.000000   5.000000
mean   16.80000  167.000000  58.000000
std     0.83666    4.690416   4.949747
min    16.00000  160.000000  52.000000
25%    16.00000  165.000000  55.000000
50%    17.00000  168.000000  58.000000
75%    17.00000  170.000000  60.000000
max    18.00000  172.000000  65.000000

In [57]:
df.info

<bound method DataFrame.info of    Tuổi  Chiều cao  Cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58>

In [58]:
df

   Tuổi  Chiều cao  Cân nặng
0    16        165        55
1    17        170        60
2    16        160        52
3    18        172        65
4    17        168        58

In [59]:
q1=df['Chiều cao'].quantile(0.25)
q3=df['Chiều cao'].quantile(0.75)
iqr=q3-q1
iqr

np.float64(5.0)

In [60]:
df_data = {
    'key':['A','B','C','A','B','C'],
    'data':range(6)
}
df=pd.DataFrame(df_data, columns=['key','data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [61]:
import pandas as pd
data = {'Tên hs':['Bình', 'Hoa','Minh','Lan','Vân'],
'Môn':['Toán','Lý','Toán','Hóa','Lý'],
'Điểm':[8,9,7,6,8]
}
df=pd.DataFrame(data)
df

  Tên hs   Môn  Điểm
0   Bình  Toán     8
1    Hoa    Lý     9
2   Minh  Toán     7
3    Lan   Hóa     6
4    Vân    Lý     8

In [64]:
grouped=df.groupby('key')
result=grouped.agg(
    {
        'giatri_1':sum, 'giatri_2':lambda x:x.mean()
    }
)
result

KeyError: 'key'

In [66]:
!python.exe -m pip install --upgrade pip

Requirement already satisfied: pip in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (25.2)
Collecting pip
  Downloading pip-25.3-py3-none-any.whl.metadata (4.7 kB)
Downloading pip-25.3-py3-none-any.whl (1.8 MB)
   ---------------------------------------- 0.0/1.8 MB ? eta -:--:--
   ----- ---------------------------------- 0.3/1.8 MB ? eta -:--:--
   ----------------------- ---------------- 1.0/1.8 MB 3.6 MB/s eta 0:00:01
   ---------------------------------------- 1.8/1.8 MB 3.5 MB/s  0:00:00
Installing collected packages: pip
  Attempting uninstall: pip
    Found existing installation: pip 25.2
    Uninstalling pip-25.2:
      Successfully uninstalled pip-25.2
Successfully installed pip-25.3

In [68]:
%pip install seaborn

Collecting seaborn
  Downloading seaborn-0.13.2-py3-none-any.whl.metadata (5.4 kB)
Requirement already satisfied: numpy!=1.24.0,>=1.20 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from seaborn) (2.3.4)
Requirement already satisfied: pandas>=1.2 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from seaborn) (2.3.3)
Requirement already satisfied: matplotlib!=3.6.1,>=3.4 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from seaborn) (3.10.7)
Requirement already satisfied: contourpy>=1.0.1 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.3.3)
Requirement already satisfied: cycler>=0.10 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (0.12.1)
Requirement already satisfied: fonttools>=4.22.0 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (4.60.1)
Requirement already satisfied: kiwisolver>=1.3.1 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (1.4.9)
Requirement already satisfied: packaging>=20.0 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (25.0)
Requirement already satisfied: pillow>=8 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (12.0.0)
Requirement already satisfied: pyparsing>=3 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (3.2.5)
Requirement already satisfied: python-dateutil>=2.7 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from matplotlib!=3.6.1,>=3.4->seaborn) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from pandas>=1.2->seaborn) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\bich\appdata\local\packages\pythonsoftwarefoundation.python.3.11_qbz5n2kfra8p0\localcache\local-packages\python311\site-packages (from python-dateutil>=2.7->matplotlib!=3.6.1,>=3.4->seaborn) (1.17.0)
Downloading seaborn-0.13.2-py3-none-any.whl (294 kB)
Installing collected packages: seaborn
Successfully installed seaborn-0.13.2
Note: you may need to restart the kernel to use updated packages.

In [69]:
!pip show seaborn

Name: seaborn
Version: 0.13.2
Summary: Statistical data visualization
Home-page:
Author:
Author-email: Michael Waskom <mwaskom@gmail.com>
License:
Location: C:\Users\BICH\AppData\Local\Packages\PythonSoftwareFoundation.Python.3.11_qbz5n2kfra8p0\LocalCache\local-packages\Python311\site-packages
Requires: matplotlib, numpy, pandas
Required-by:

In [70]:
import pandas as pd
import seaborn as sns
titanic_data = sns.load_dataset("titanic")
titanic_data.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [71]:
titanic_data.groupby("sex")["age"].mean()

sex
female    27.915709
male      30.726645
Name: age, dtype: float64

In [72]:
gb_age=titanic_data.groupby(["sex", "class"])["age"].mean()
gb_age_unstack=gb_age.unstack()
gb_age_unstack

C:\Users\BICH\AppData\Local\Temp\ipykernel_1756\1514654347.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  gb_age=titanic_data.groupby(["sex", "class"])["age"].mean()

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [73]:
pivot_age = pd.pivot_table(titanic_data,values="age",index="sex",columns="class",aggfunc="mean",observed=True)
pivot_age

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [74]:
gb_age_unstack

class       First     Second      Third
sex
female  34.611765  28.722973  21.750000
male    41.281386  30.740707  26.507589

In [76]:
titanic_data.isna().sum().sort_values(ascending=False)

deck           688
age            177
embarked         2
embark_town      2
sex              0
pclass           0
survived         0
fare             0
parch            0
sibsp            0
class            0
adult_male       0
who              0
alive            0
alone            0
dtype: int64

In [77]:
print('Số hàng ban đầu của CSDL:', len(titanic_data))

titanic_data.drop(labels='deck', axis=1, inplace=True)

titanic_data.dropna(how='any', axis=0, inplace=True)

print('Số hàng còn lai tỏng CSDL:', len(titanic_data))

Số hàng ban đầu của CSDL: 891
Số hàng còn lai tỏng CSDL: 712

In [78]:
titanic_data.head(7)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,Southampton,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,Southampton,no,False